; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    ; (can_traverse ?x ?y ?z)
    (at ?x ?y)
    ; (visible ?y ?z)
    )
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=4, waypoints=9, cameras=4, objectives=9, out_folder=training/easy, instance_id=86, seed=121

(define (problem rover-86)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 - objective)
 (:init 
    (at_lander general waypoint2)
    (at rover1 waypoint4)
    (at rover2 waypoint7)
    (at rover3 waypoint3)
    (at rover4 waypoint9)
    (equipped_for_soil_analysis rover1)
    (equipped_for_soil_analysis rover3)
    (equipped_for_rock_analysis rover4)
    (equipped_for_rock_analysis rover3)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint5)
    (at_rock_sample waypoint7)
    (at_rock_sample waypoint9)
    (at_soil_sample waypoint3)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint7)
    (at_soil_sample waypoint8)
    (visible waypoint7 waypoint4)
    (visible waypoint2 waypoint4)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint8 waypoint7)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint9 waypoint5)
    (visible waypoint5 waypoint9)
    (visible waypoint2 waypoint5)
    (visible waypoint4 waypoint1)
    (visible waypoint4 waypoint7)
    (visible waypoint7 waypoint8)
    (visible waypoint5 waypoint2)
    (can_traverse rover1 waypoint7 waypoint4)
    (can_traverse rover1 waypoint2 waypoint4)
    (can_traverse rover1 waypoint3 waypoint4)
    (can_traverse rover1 waypoint4 waypoint3)
    (can_traverse rover1 waypoint8 waypoint7)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint1 waypoint4)
    (can_traverse rover1 waypoint4 waypoint2)
    (can_traverse rover1 waypoint9 waypoint5)
    (can_traverse rover1 waypoint5 waypoint9)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint4 waypoint1)
    (can_traverse rover1 waypoint4 waypoint7)
    (can_traverse rover1 waypoint7 waypoint8)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover2 waypoint7 waypoint4)
    (can_traverse rover2 waypoint2 waypoint4)
    (can_traverse rover2 waypoint3 waypoint4)
    (can_traverse rover2 waypoint4 waypoint3)
    (can_traverse rover2 waypoint8 waypoint7)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover2 waypoint1 waypoint4)
    (can_traverse rover2 waypoint4 waypoint2)
    (can_traverse rover2 waypoint9 waypoint5)
    (can_traverse rover2 waypoint5 waypoint9)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint4 waypoint1)
    (can_traverse rover2 waypoint4 waypoint7)
    (can_traverse rover2 waypoint7 waypoint8)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover3 waypoint7 waypoint4)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint3 waypoint4)
    (can_traverse rover3 waypoint4 waypoint3)
    (can_traverse rover3 waypoint8 waypoint7)
    (can_traverse rover3 waypoint4 waypoint6)
    (can_traverse rover3 waypoint6 waypoint4)
    (can_traverse rover3 waypoint1 waypoint4)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover3 waypoint9 waypoint5)
    (can_traverse rover3 waypoint5 waypoint9)
    (can_traverse rover3 waypoint2 waypoint5)
    (can_traverse rover3 waypoint4 waypoint1)
    (can_traverse rover3 waypoint4 waypoint7)
    (can_traverse rover3 waypoint7 waypoint8)
    (can_traverse rover3 waypoint5 waypoint2)
    (can_traverse rover4 waypoint7 waypoint4)
    (can_traverse rover4 waypoint2 waypoint4)
    (can_traverse rover4 waypoint3 waypoint4)
    (can_traverse rover4 waypoint4 waypoint3)
    (can_traverse rover4 waypoint8 waypoint7)
    (can_traverse rover4 waypoint4 waypoint6)
    (can_traverse rover4 waypoint6 waypoint4)
    (can_traverse rover4 waypoint1 waypoint4)
    (can_traverse rover4 waypoint4 waypoint2)
    (can_traverse rover4 waypoint9 waypoint5)
    (can_traverse rover4 waypoint5 waypoint9)
    (can_traverse rover4 waypoint2 waypoint5)
    (can_traverse rover4 waypoint4 waypoint1)
    (can_traverse rover4 waypoint4 waypoint7)
    (can_traverse rover4 waypoint7 waypoint8)
    (can_traverse rover4 waypoint5 waypoint2)
    (calibration_target camera1 objective5)
    (on_board camera1 rover3)
    (supports camera1 colour)
    (supports camera1 low_res)
    (calibration_target camera2 objective7)
    (on_board camera2 rover1)
    (supports camera2 low_res)
    (supports camera2 high_res)
    (calibration_target camera3 objective8)
    (on_board camera3 rover3)
    (supports camera3 low_res)
    (calibration_target camera4 objective7)
    (on_board camera4 rover1)
    (supports camera4 high_res)
    (supports camera4 low_res)
    (supports camera4 colour)
    (visible_from objective1 waypoint9)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint8)
    (visible_from objective1 waypoint4)
    (visible_from objective1 waypoint7)
    (visible_from objective2 waypoint2)
    (visible_from objective2 waypoint4)
    (visible_from objective3 waypoint8)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint7)
    (visible_from objective3 waypoint9)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint1)
    (visible_from objective4 waypoint6)
    (visible_from objective4 waypoint4)
    (visible_from objective4 waypoint7)
    (visible_from objective5 waypoint3)
    (visible_from objective5 waypoint4)
    (visible_from objective5 waypoint8)
    (visible_from objective5 waypoint1)
    (visible_from objective5 waypoint6)
    (visible_from objective5 waypoint7)
    (visible_from objective5 waypoint5)
    (visible_from objective5 waypoint2)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint9)
    (visible_from objective6 waypoint8)
    (visible_from objective6 waypoint1)
    (visible_from objective7 waypoint3)
    (visible_from objective7 waypoint2)
    (visible_from objective7 waypoint5)
    (visible_from objective7 waypoint7)
    (visible_from objective7 waypoint6)
    (visible_from objective8 waypoint3)
    (visible_from objective8 waypoint7)
    (visible_from objective8 waypoint4)
    (visible_from objective8 waypoint2)
    (visible_from objective8 waypoint1)
    (visible_from objective8 waypoint9)
    (visible_from objective8 waypoint6)
    (visible_from objective8 waypoint8)
    (visible_from objective9 waypoint3)
    (visible_from objective9 waypoint9)
    (visible_from objective9 waypoint2)
    (visible_from objective9 waypoint8)
    (visible_from objective9 waypoint1))
 (:goal  (and 
    (communicated_rock_data waypoint3)
    (communicated_rock_data waypoint7)
    (communicated_rock_data waypoint9)
    (communicated_rock_data waypoint2)
    
    )))

; plan
1. (sample_rock rover4 rover4store waypoint9)
   deleted: (empty rover4store) (at_rock_sample waypoint9)
   added: (full rover4store) (have_rock_analysis rover4 waypoint9)
   goals met: 0 of 4
2. (navigate rover4 waypoint9 waypoint5)
   deleted: (at rover4 waypoint9)
   added: (at rover4 waypoint5)
   goals met: 0 of 4
3. (communicate_rock_data rover4 general waypoint9 waypoint5 waypoint2)
   added: (communicated_rock_data waypoint9)
   goals met: 1 of 4
4. (sample_rock rover3 rover3store waypoint3)
   deleted: (empty rover3store) (at_rock_sample waypoint3)
   added: (full rover3store) (have_rock_analysis rover3 waypoint3)
   goals met: 1 of 4
5. (navigate rover3 waypoint3 waypoint4)
   deleted: (at rover3 waypoint3)
   added: (at rover3 waypoint4)
   goals met: 1 of 4
6. (communicate_rock_data rover3 general waypoint3 waypoint4 waypoint2)
   added: (communicated_rock_data waypoint3)
   goals met: 2 of 4
7. (navigate rover3 waypoint4 waypoint7)
   deleted: (at rover3 waypoint4)
   added: (at rover3 waypoint7)
   goals met: 2 of 4
8. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 2 of 4
9. (sample_rock rover3 rover3store waypoint7)
   deleted: (empty rover3store) (at_rock_sample waypoint7)
   added: (full rover3store) (have_rock_analysis rover3 waypoint7)
   goals met: 2 of 4
10. (navigate rover3 waypoint7 waypoint4)
   deleted: (at rover3 waypoint7)
   added: (at rover3 waypoint4)
   goals met: 2 of 4
11. (communicate_rock_data rover3 general waypoint7 waypoint4 waypoint2)
   added: (communicated_rock_data waypoint7)
   goals met: 3 of 4
12. (navigate rover4 waypoint5 waypoint2)
   deleted: (at rover4 waypoint5)
   added: (at rover4 waypoint2)
   goals met: 3 of 4
13. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 3 of 4
14. (sample_rock rover4 rover4store waypoint2)
   deleted: (empty rover4store) (at_rock_sample waypoint2)
   added: (full rover4store) (have_rock_analysis rover4 waypoint2)
   goals met: 3 of 4
15. (navigate rover4 waypoint2 waypoint4)
   deleted: (at rover4 waypoint2)
   added: (at rover4 waypoint4)
   goals met: 3 of 4
16. (communicate_rock_data rover4 general waypoint2 waypoint4 waypoint2)
   added: (communicated_rock_data waypoint2)
   goals met: 4 of 4
